export const testimonials = [
  {
    name: "Наталія",
    text: [
      "Ми з тобою вже 2 роки разом, і я тебе ніколи не відпущу! 🫂",
      "Я дуже вдячна за все: як ти мене витягувала з нуля, як ми разом готувались до співбесід, і як ти підтримувала мене в усі моменти.",
      "Ти бачила мене різною: заплаканою, замученою, щасливою… і ось ми вже йдемо до С1!! Це все завдяки підтримці та енергії яку ти віддаєш. Ти неймовірна, і я дуже вдячна за кожне наше заняття! 💘",
    ],
    initialLevel: 1,
    currentLevel: 5,
  },
  {
    name: "Катерина",
    text: [
      "Я переїхала до Швейцарії рік тому, не маючи роботи і не знаючи мови. Початок був 👍🏻",
      "Ну давай я швидко шукати репетитора. І знайшла не просто репетитора, а людину!",
      "Ти, мабуть, ще ніколи нікого не вчила з такою швидкістю, як мене. 😁 Я одразу сказала: “Мені треба якнайшвидше, щоб просто взяли на роботу!”",
      "За пів року я з А1 дійшла до Б1 і влаштувалась на роботу. ❤️‍🩹",
      "А як ти мене готувала до співбесід — ніколи не забуду. Дякую за все!",
    ],
    initialLevel: 2,
    currentLevel: 4,
  },
  {
    name: "Єва",
    text: [
      "Завжди мріяла про таке ком’юніті, як у вас! 🤍 У школі та університеті сильних досягнень не було, і я думала, що проблема в мені. Але ви це змінили!",
      "На ваших заняттях я почуваю себе дуже тепло, а перед уроками завжди роблю каву для ще більшого задоволення. ✨ Одне заняття з вами — це як 11 років школи, тільки краще!",
    ],
    initialLevel: 2,
    currentLevel: 5,
  },
  {
    name: "Олександр",
    text: [
      "Чесно, я не вмію писати фідбеки, але хочу бути щирим. 🙌🏻",
      "Прийшов до вас рік тому, думаючи, що довго не затримаюсь (знаю себе). Хотілося вивчити англійську, але був впевнений, що кину. Але ні! Завдяки вам та вашій підтримці я залишився. ",
      "По результату: прийшов з “А-100”, хоч такого і не існує, а зараз у мене впевнений Б2!",
      "Тут просто без зайвих слів 🤌🏻",
    ],
    initialLevel: 0,
    currentLevel: 5,
  },
  {
    name: "Марія",
    text: [
      "У мене таке почуття, що я шукала тебе все життя! ✨ І нарешті знайшла.",
      "На заняттях я почуваюся з тобою ніби з подругою, яка десь за кордоном пояснює мені англійську. Якби це не прозвучало, але з тобою я відчуваю себе безпечно. Можу розповісти все, що завгодно і мене навіть не засудять, і це все ще й англійською. Де б я ще таке знайшла? 🤌🏻",
      "А з тесту, який я проходила на початку та того, який був тиждень тому, я взагалі була в шоці 😳",
      "Я реально не можу усвідомити, що я тепер Б1. Раніше для мене це було щось НЕМОЖЛИВЕ! 💓",
    ],
    initialLevel: 0,
    currentLevel: 4,
  },
  {
    name: "Вікторія",
    text: [
      "Мені здається, що ви - це найкраще, що траплялося зі мною останнім часом. 🤍 У моєму житті було багато труднощів, але ваша школа стала моєю другою сім’єю.",
      "Після важких днів я бігла на наші заняття, бо там завжди було тепло, затишно і можна бути собою. 💗",
      "Де ще можна вчитись, виговорюватись і розвиватися одночасно? Ви — моє серденько! ✨",
    ],
    initialLevel: 2,
    currentLevel: 4,
  },
  {
    name: "Олександра",
    text: [
      "Мені завжди здавалось, що почати говорити англійською — це щось нереальне. Роками треба вчитись, щоб заговорити.",
      "Але ти показала мені зовсім іншу реальність!",
      "Я прийшла до тебе взагалі з нуля. Пам’ятала тільки 'cat' та 'dog', але ти витягувала мене крок за кроком… і все здавалося таким легким! 🤍",
      "Тепер думаю: а що я 10 років тому робила?",
      "Дякую тобі за ці результати! Ти моя супергероїня! 💗",
    ],
    initialLevel: 1,
    currentLevel: 3,
  },
  {
    name: "Анастасія",
    text: [
      "Не забуду, як ти мене підтримувала, коли я лаялась на всі ці правила. 🥺 Саме з тобою у мене пішов страх розмовляти англійською. Тепер я бачу результат наших годин занять!",

      "Коли переїхала до Дербі, думала, що все: англійську я не вивчу. Але ти мене виручила, як ніхто інший. Дякую, Саш! ❤️‍🩹",
    ],
    initialLevel: 2,
    currentLevel: 5,
  },
  {
    name: "Дарʼя",
    text: [
      "Боже, ваша школа це щось! 🥰 Наші заняття в групі — це щось неймовірне!",
      "Це тепер моя друга сім’я! 🤍",
      "Я в житті не думала, що взагалі колись почну говорити англійською і ще й захочу вчити щось нове.",
      "Результати просто вау! Я відчуваю себе супер впевнено і вже маю Б2, ще трохи залишилось до цілі! 💘",
    ],
    initialLevel: 2,
    currentLevel: 5,
  },
  {
    name: "Анна",
    text: [
      "Ти зе бест! ✨ За все життя в мене було 5-6 репетиторів і кілька вчителів у школі. І з’явилось клеймо, що мови — це щось нудне, складне і взагалі не моє. Але… бам! У моєму житті з’явилася ти.",
      "Зараз я вже розмовляю! А головне, що все здавалось такииим цікавим та зрозумілим!💗",
      "А я все ще чекаю, коли ти вивчиш французьку, щоб вивчити нову мову 😁",
    ],
    initialLevel: 1,
    currentLevel: 4,
  },
  {
    name: "Марія",
    text: [
      "Сашуль, я не очікувала, що наші заняття так сильно западуть мені в душу. 💓 Твій підхід і ти сама — неймовірні!",
      "Прийшла до тебе з ледь-ледь А2, а зараз у мене твердий Б1! ✨ Пам’ятаю, яка каша була в моїй голові. Але саме завдяки тобі я не кинула все. Дякую тобі, люба!",
    ],
    initialLevel: 3,
    currentLevel: 4,
  },
];

//   const levels = ["0", "А0", "A1", "A2", "B1", "B2", "C1"];
//                    0    1     2      3     4     5     6
